DataProcessors/APPLIX_RU_СМ_ОПрограмме.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>APPLIX_RU_СМ_ОПрограмме</Name>
			<Comment>applix.ru (c)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Р_Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ДатаОкончанияТП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ДемоРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ИдентификаторПрограммы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_КлючАктивации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_НазваниеПрограммы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_НазваниеПрограммыПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ОписаниеЛицензии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ОписаниеПрограммы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ИНФО_Обновление_Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ИНФО_Обновление_Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ИНФО_Техподдержка_Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ИНФО_Техподдержка_СсылкаНаФорум</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ИНФО_Техподдержка_СсылкаНаСтраницу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ИНФО_Разработчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_КлючАктивации_ИмяКонстанты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ИмяПараметраСеансаКэш</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_КЭШ</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_Техподдержка_СсылкаНаЛицензионноеСоглашение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_Техподдержка_СсылкаНаТехподдержку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ВерсияПодсистемы</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/APPLIX_RU_СМ_ОПрограмме/Forms/ФормаУпр/Ext/Form/Module.bsl
&НаСервере
Перем ОбработкаОбъект;






// РЕГИСТРАЦИЯ //////////////////////////////////////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Функция Команда_РегистрацияПрограммы(Команда)
	
	ПараметрыФормы = Новый Структура("ИД,Р_ИмяКонстанты", Объект.Р_ИдентификаторПрограммы, Объект.Р_КлючАктивации_ИмяКонстанты);
	ФайлКлюч = ОткрытьФорму("Обработка.APPLIX_RU_СМ_Регистрация.Форма.ФормаУпр", ПараметрыФормы, ЭтаФорма, "applix_ru_activate_programm_key");//, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецФункции


&НаСервере
Функция Регистрация_ИнформацияОЛицензии_Обновить(_КлючАктивации="") Экспорт
	Если ЗначениеЗаполнено(_КлючАктивации) Тогда
		Объект.Р_КлючАктивации = _КлючАктивации;
	КонецЕсли;
	
	
	// Очистить кэш
	Попытка
		ПараметрыСеанса[Объект.Р_ИмяПараметраСеансаКэш] = "";
	Исключение
		т = ОписаниеОшибки();
	КонецПопытки;
	
	
	ДанныеПрограммы = Новый Структура;
	ДанныеПрограммы.Вставить("Ключ", Объект.Р_КлючАктивации);
	ДанныеПрограммы.Вставить("ИдентификаторПрограммы", Объект.Р_ИдентификаторПрограммы);
	ДанныеПрограммы.Вставить("ВерсияПодсистемы", Объект.Р_ВерсияПодсистемы);
	ДанныеПрограммы.Вставить("ИмяПараметраСеансаКэш", Объект.Р_ИмяПараметраСеансаКэш);
	
	Обр = Обработки.APPLIX_RU_СМ_Регистрация.Создать();
	Инфо = Обр.ПолучитьОписаниеЛицензии(ДанныеПрограммы);
	
	Объект.Р_ОписаниеЛицензии = Инфо.Описание;
	Объект.Р_ДатаОкончанияТП = Инфо.ДатаОкончанияТП;
	
КонецФункции



// КОМАНДЫ О ПРОГРАММЕ

//---------------------------------------------------------------------------------------------------------------------------------------
&НаКлиенте
Функция Команда_ОткрытьСтраницуПрограммы(Команда = "")
	ЗапуститьПриложение(Объект.Р_Техподдержка_СсылкаНаСтраницу);
КонецФункции

&НаКлиенте
Функция Команда_ОткрытьСтраницуЛицензионногоСоглашения(Команда = "")
	Объект_ОткрытьСтраницуСайта("СОГЛАШЕНИЕ");
КонецФункции

&НаКлиенте
Функция Команда_ОткрытьСтраницуТехподдержки(Команда = "")
	Объект_ОткрытьСтраницуСайта("ТЕХПОДДЕРЖКА");
КонецФункции

&НаКлиенте
Процедура Команда_ОткрытьСайтАвтора(Команда)
	ЗапуститьПриложение("http://applix.ru/");
КонецПроцедуры



// КАТАЛОГ РЕШЕНИЙ

//---------------------------------------------------------------------------------------------------------------------------------------
Функция Объект_КаталогРешений_Вывести()
	Рез = "";
	
	Объект_ИнициализироватьОбработку(Истина);
	
	АдресВХ = ОбработкаОбъект.APPLIX_RU_ПолучитьМакетОбработки("КаталогРешений");
	ТД = ПолучитьИзВременногоХранилища(АдресВХ);
	Для каждого КЗ Из Объект.Р_КЭШ.СписокСсылокНаРазработки Цикл
		APPLIX_RU_СМ_ОбщийМодульКлиентСервер.СМ_УстановитьЗначениеСтруктуры(ТД.Параметры, КЗ.Ключ, КЗ.Ключ);
	КонецЦикла;
	ПолеТабличногоДокумента_КаталогРешений.Вывести(ТД);
	
	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура Объект_КаталогРешений_Выбор(Элемент, Область, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Объект_ОткрытьСтраницуСайта(Область.Расшифровка);
КонецПроцедуры

&НаКлиенте
Процедура Команда_ОткрытьСтраницуЭтойРазработкиНажатие(Элемент)
	Объект_ОткрытьСтраницуСайта("ЭТОТМОДУЛЬ");
КонецПроцедуры

&НаКлиенте
Процедура Объект_ОткрытьСтраницуСайта(ИмяРазработки)
	
	АдресСсылки = Объект.Р_КЭШ.СписокСсылокНаРазработки.Получить(ВРег(ИмяРазработки));
	Если Не ЗначениеЗаполнено(АдресСсылки) Тогда
		АдресСсылки = Объект.Р_КЭШ.СписокСсылокНаРазработки.Получить("ВСЕРАЗРАБОТКИ");
	КонецЕсли;
	ЗапуститьПриложение(АдресСсылки);
	
КонецПроцедуры




// РЕГИСТРАЦИЯ ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//Функция Регистрация_ПолучитьФайлОбработки_Сервер()
//	АдресФайлаВХранилище = APPLIX_RU_ПолучитьФайлОбработкиРегистрации();
//	Возврат АдресФайлаВХранилище;
//КонецФункции




&НаКлиенте
Функция Регистрация_ПроверитьОбновление()
	Объект.Р_ИНФО_Обновление_Версия = "";
	Объект.Р_ИНФО_Обновление_Информация = "";
	Объект.Р_ИНФО_Техподдержка_Информация = "";
	
	тмп = ПолучитьИмяВременногоФайла();
	Попытка
		КопироватьФайл("http://applix.ru/support1c/"+Объект.Р_ИдентификаторПрограммы+"/version.txt", тмп);
		т = Новый ТекстовыйДокумент;
		т.Прочитать(тмп);
		Р_ИНФО_Обновление_Версия = т.ПолучитьТекст();

		КопироватьФайл("http://applix.ru/support1c/"+Объект.Р_ИдентификаторПрограммы+"/info.txt", тмп);
		т = Новый ТекстовыйДокумент;
		т.Прочитать(тмп);
		Р_ИНФО_Обновление_Информация = т.ПолучитьТекст();
		
		Если Р_ИНФО_Обновление_Версия>Объект.Р_Версия Тогда
			Элементы.Надпись_ТП_ЕстьОбновления.Заголовок = "Есть обновления";
		Иначе
			Элементы.Надпись_ТП_ЕстьОбновления.Заголовок = "Обновлений нет";
		КонецЕсли;
		
		Элементы.ПанельТехподдержка.ТекущаяСтраница = Элементы.ПанельТП_Обновление;
		
	Исключение
		Объект.Р_ИНФО_Техподдержка_Информация = "Не удалось подключиться к серверу.";
		Объект.Р_ИНФО_Техподдержка_Информация = Объект.Р_ИНФО_Техподдержка_Информация + Символы.ПС + "Возможно компьютер не подключен к сети интернет.";
		Объект.Р_ИНФО_Техподдержка_Информация = Объект.Р_ИНФО_Техподдержка_Информация + Символы.ПС + "Либо на сервере нет информации по обновлениям.";
		Элементы.ПанельТехподдержка.ТекущаяСтраница = Элементы.ПанельТП_Информация;
	КонецПопытки;
КонецФункции

&НаКлиенте
Функция Регистрация_ОткрытьОкноТехподдержки()
	Элементы.ПанельОсновная.ТекущаяСтраница = Элементы.ПанельОсновная.Страницы.Техподдержка;
КонецФункции




&НаКлиенте
Функция Техподдержка_ОткрытьСайт(СсылкаНаСтраницу)
	Если ЗначениеЗаполнено(СсылкаНаСтраницу) Тогда
		ТП_Сайт = СсылкаНаСтраницу;
		Элементы.ПанельТехподдержка.ТекущаяСтраница = Элементы.ПанельТП_Сайт;
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция Техподдержка_ЗадатьВопрос()
	Р_ИНФО_Техподдержка_Информация = "Создайте новую тему и задайте с ней вопрос, или задайте вопрос в существующей теме.";
	Техподдержка_ОткрытьСайт(Объект.Р_ИНФО_Техподдержка_СсылкаНаФорум);
КонецФункции

&НаКлиенте
Функция Техподдержка_НаписатьОтзыв()
	Р_ИНФО_Техподдержка_Информация = "Перейдите на закладку ОТЗЫВЫ ПОКУПАТЕЛЕЙ и нажмите Добавить отзыв. Ваше мнение очень важно для нас.";
	Техподдержка_ОткрытьСайт(Объект.Р_ИНФО_Техподдержка_СсылкаНаСтраницу);
КонецФункции

&НаКлиенте
Функция Техподдержка_Купить()
	Р_ИНФО_Техподдержка_Информация = "Перейдите на закладку КУПИТЬ и выберите нужную поставку.";
	Техподдержка_ОткрытьСайт(Объект.Р_ИНФО_Техподдержка_СсылкаНаСтраницу);
КонецФункции

&НаКлиенте
Функция Техподдержка_ОткрытьСайтАвтора(Команда="")
	ЗапуститьПриложение("www.applix.ru");
КонецФункции





// ФОРМА ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Функция Объект_ИнициализироватьОбработку(Обновить=Ложь)
	Если (ОбработкаОбъект=Неопределено) или (Обновить) Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
КонецФункции






// СЛУЖЕБНЫЕ ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Функция APPLIX_RU_ПолучитьЗначениеСтруктуры(пСтруктура, Индекс, ЗначениеПоУмолчанию=Неопределено) Экспорт
	
	Попытка
		Возврат пСтруктура[Индекс];
	Исключение
	КонецПопытки;
	
	Возврат ЗначениеПоУмолчанию;
КонецФункции






&НаКлиенте
Процедура Команда_ТП_ПроверитьОбновление(Команда)
	Регистрация_ПроверитьОбновление();
КонецПроцедуры

&НаКлиенте
Процедура Команда_ТП_ЗадатьВопрос(Команда)
	Техподдержка_ЗадатьВопрос();
КонецПроцедуры

&НаКлиенте
Процедура Команда_ТП_НаписатьОтзыв(Команда)
	Техподдержка_НаписатьОтзыв();
КонецПроцедуры

&НаКлиенте
Процедура Команда_ТП_Купить(Команда)
	Техподдержка_Купить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Объект_ЗаполнитьНачальныеНастройки();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
	Элементы.Декорация_ИнфоРазработчик.Заголовок = Объект.Р_ИНФО_Разработчик;
	
	Объект.Р_КлючАктивации = APPLIX_RU_ПолучитьЗначениеСтруктуры(Параметры, "КлючАктивации");
	Объект.Р_НазваниеПрограммы = APPLIX_RU_ПолучитьЗначениеСтруктуры(Параметры, "НазваниеПрограммы");
	Объект.Р_НазваниеПрограммыПолное = APPLIX_RU_ПолучитьЗначениеСтруктуры(Параметры, "НазваниеПрограммыПолное");
	Объект.Р_ОписаниеПрограммы = APPLIX_RU_ПолучитьЗначениеСтруктуры(Параметры, "ОписаниеПрограммы");
	Объект.Р_Версия = APPLIX_RU_ПолучитьЗначениеСтруктуры(Параметры, "Версия");
	Объект.Р_ИдентификаторПрограммы = APPLIX_RU_ПолучитьЗначениеСтруктуры(Параметры, "ИдентификаторПрограммы");
	Объект.Р_ДемоРежим = APPLIX_RU_ПолучитьЗначениеСтруктуры(Параметры, "ДемоРежим");
	Объект.Р_ИНФО_Техподдержка_СсылкаНаФорум = APPLIX_RU_ПолучитьЗначениеСтруктуры(Параметры, "ИНФО_Техподдержка_СсылкаНаФорум");
	Объект.Р_ИНФО_Техподдержка_СсылкаНаСтраницу = APPLIX_RU_ПолучитьЗначениеСтруктуры(Параметры, "ИНФО_Техподдержка_СсылкаНаСтраницу");
	//Объект.Регистрация_Описание = APPLIX_RU_ПолучитьЗначениеСтруктуры(Параметры, "Регистрация_Описание");
	Объект.Р_ДатаОкончанияТП = APPLIX_RU_ПолучитьЗначениеСтруктуры(Параметры, "Регистрация_ДатаОкончанияТП");
	Объект.Р_КлючАктивации_ИмяКонстанты = APPLIX_RU_ПолучитьЗначениеСтруктуры(Параметры, "КлючАктивации_ИмяКонстанты");
	Объект.Р_ИмяПараметраСеансаКэш = APPLIX_RU_ПолучитьЗначениеСтруктуры(Параметры, "ИмяПараметраСеансаКэш");
	Объект.Р_ВерсияПодсистемы = APPLIX_RU_ПолучитьЗначениеСтруктуры(Параметры, "ВерсияПодсистемы");
	
	
	Регистрация_ИнформацияОЛицензии_Обновить();
	
	
	Объект_КаталогРешений_Вывести();
КонецПроцедуры


&НаКлиенте
Процедура Команда_ОбновитьОписаниеЛицензии(Команда)
	Регистрация_ИнформацияОЛицензии_Обновить(Объект.Р_КлючАктивации);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Регистрация_ИнформацияОЛицензии_Обновить(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ПанельТехподдержка.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	ЭтаФорма.Заголовок = "О программе: " + Объект.Р_НазваниеПрограммы;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ВозможныеНазванияАктивации = Новый Массив;
	ВозможныеНазванияАктивации.Добавить("APPLIX_RU_АктивацияПрограммы");
	ВозможныеНазванияАктивации.Добавить("APPLIX_RU_АктивацияПрограммы"+Объект.Р_ИдентификаторПрограммы);
	Если ВозможныеНазванияАктивации.Найти(ИмяСобытия)<>Неопределено Тогда
		Объект.Р_КлючАктивации = Параметр;
	КонецЕсли;
	Регистрация_ИнформацияОЛицензии_Обновить(Объект.Р_КлючАктивации);
КонецПроцедуры
